# Q1)

In [2]:
import pandas as pd

In [5]:
print(pd.__version__)

1.0.5

# Q2

In [37]:
import numpy as np

In [9]:
data = np.array(['a', 'b', 'c', 'd', 'e'])

In [11]:
s = pd.Series(data) 
print(s)
print(type(s))

0    a
1    b
2    c
3    d
4    e
dtype: object
<class 'pandas.core.series.Series'>

# Q3)

In [4]:
df = pd.DataFrame({'Name': ['Sangharsh', 'Yash', 'Aditya', 'Deven']})
df['index']=df.index
df

        Name  index
0  Sangharsh      0
1       Yash      1
2     Aditya      2
3      Deven      3

# Q4)

In [14]:
import seaborn as sns

In [31]:
print (sns.get_dataset_names())

['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'exercise', 'flights', 'fmri', 'gammas', 'geyser', 'iris', 'mpg', 'penguins', 'planets', 'tips', 'titanic']

In [33]:
mpg = sns.load_dataset('mpg')

In [34]:
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

# Q5)

In [36]:
mpg['origin'].unique()

array(['usa', 'japan', 'europe'], dtype=object)

# Q6)

In [52]:
origin_usa=mpg[mpg["origin"]=="usa"]
origin_usa.sample(7)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
47,19.0,6,250.0,100.0,3282,15.0,71,usa,pontiac firebird
88,14.0,8,302.0,137.0,4042,14.5,73,usa,ford gran torino
298,23.0,8,350.0,125.0,3900,17.4,79,usa,cadillac eldorado
42,12.0,8,383.0,180.0,4955,11.5,71,usa,dodge monaco (sw)
252,19.2,6,231.0,105.0,3535,19.2,78,usa,pontiac phoenix lj
250,19.4,8,318.0,140.0,3735,13.2,78,usa,dodge diplomat
174,18.0,6,171.0,97.0,2984,14.5,75,usa,ford pinto